000100000000     A************************************************************
000200000000     A
000300000000     A          R QLIDOBJD
000400180716     A            ODOBNM        10A         TEXT(' ')
